app/controllers/charge_controller.rb

	def free
		project = Project.find(params[:project_id])
		current_user.subscriptions.create(project: project)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "subscriptions" ("project_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["project_id", 2], ["user_id", 3], ["created_at", "2017-12-06 16:14:15.316367"], ["updated_at", "2017-12-06 16:14:15.316367"]]

	def pay
		project = Project.find(params[:project_id])
		customer = Stripe::Customer.create(
	    :email => params[:stripeEmail],
	    :source  => params[:stripeToken]
	  )

	  charge = Stripe::Charge.create(
	    :customer    => customer.id,
	    :amount      => project.price_in_cents,
	    :description => project.name,
	    :currency    => 'usd'
	  )

		if charge
			current_user.subscriptions.create(project: project)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "subscriptions" ("project_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["project_id", 4], ["user_id", 2], ["created_at", "2017-12-11 02:50:05.092518"], ["updated_at", "2017-12-11 02:50:05.092518"]]