app/controllers/project_controller.rb

  def show
    @project = Project.find(params[:id])
    @tasks = @project.tasks.order(:tag)

    @joined = false

    if !current_user.nil? && !current_user.projects.nil?
      @joined = current_user.projects.include?(@project)
    end

    @users = @project.users.order('created_at desc').first(10)

    @review = Review.new
    @reviews = @project.reviews

    @hasreview = @reviews.find_by(user_id: current_user.id) if current_user
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1 ORDER BY "tasks"."tag" ASC  [["project_id", 1]]
SELECT  1 AS one FROM "projects" INNER JOIN "subscriptions" ON "projects"."id" = "subscriptions"."project_id" WHERE "subscriptions"."user_id" = $1 AND "projects"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 2], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 1]]
SELECT  "users".* FROM "users" INNER JOIN "subscriptions" ON "users"."id" = "subscriptions"."user_id" WHERE "subscriptions"."project_id" = $1 ORDER BY created_at desc LIMIT $2  [["project_id", 2], ["LIMIT", 10]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."project_id" = $1 AND "reviews"."user_id" = $2 LIMIT $3  [["project_id", 3], ["user_id", 3], ["LIMIT", 1]]