app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("project_id", "user_id", "comment", "created_at", "star", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["project_id", 3], ["user_id", 3], ["comment", "This is cool"], ["created_at", "2017-12-08 15:34:51.859527"], ["star", 2], ["updated_at", "2017-12-08 15:34:51.859527"]]
---
  def create
    @review = Review.create(review_params)

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 1]]
---
  def destroy
    @review = Review.find(params[:id])
    project = @review.project
    @review.destroy