app/controllers/task_controller.rb

  def show
    project = Project.find(params[:project_id])
    @tasks = project.tasks.order(:tag)

    joined = false

    if !current_user.nil? && !current_user.projects.nil?
      joined = current_user.projects.include?(project)
    end

    if joined
      @task = @tasks.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1 AND (tag < 'React-Tutorial' AND header = 'f') ORDER BY "tasks"."tag" DESC LIMIT $2  [["project_id", 3], ["LIMIT", 1]]
SELECT  1 AS one FROM "projects" INNER JOIN "subscriptions" ON "projects"."id" = "subscriptions"."project_id" WHERE "subscriptions"."user_id" = $1 AND "projects"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 3], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["project_id", 1], ["id", 1], ["LIMIT", 1]]